In [5]:
import pandas as pd
import numpy as np

In [18]:
df = pd.DataFrame({'X':[78,85,96,80,86,1,2], 'Y':[84,94,89,83,86,1,1], 'Z':[86,97,96,72,83,1,2]});
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83
5   1   1   1
6   2   1   2

DF Head defaults to give you the first 5 observations; 
Important: Rows start from row 0

In [19]:
df.head(6)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83
5   1   1   1

Tail defaults to give you the last 5 observations from the bottom up

In [22]:
df.tail()

    X   Y   Z
2  96  89  96
3  80  83  72
4  86  86  83
5   1   1   1
6   2   1   2

DF Shape gives you the number of rows and number of columns
No parenthesis required because there is no argument, otherwise values inside parenthesis gives you an argument

In [23]:
df.shape

(7, 3)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       7 non-null      int64
 1   Y       7 non-null      int64
 2   Z       7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

df.info gives full description of your dataframe; 
It gives you number of observations vs number of columns; it gives you null and non-null values, where non-null means there are no missing values; the datatype for the column is classified as an integer 64-bit ie int64 and the memory usage is how much memory is used for the dataframe which is good information when you have a massive dataframe

In [25]:
df.describe()

               X          Y          Z
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

df.describe gives all statistical values of your columns. count is number of observations per column. rows. mean is average value per column. std is standard deviation per column. the min is the minimum value in the column and max is the largest value in the column. 25% is the 25th value 75% is the 75th value and 50% is the 50th value.

Shift-Tab inside the parenthesis gives you the possibilities to test certain arguments relevant to the code

In [28]:
df[['Y', 'Z', 'X']]

    Y   Z   X
0  84  86  78
1  94  97  85
2  89  96  96
3  83  72  80
4  86  83  86
5   1   1   1
6   1   2   2

df.iloc[:,0] df.iloc[:,0] #the colon means to get everything in that column and the 0 refers to the column indice which in this case is X

In [37]:
df.iloc[3:5,2]

3    72
4    83
Name: Z, dtype: int64

In [39]:
df.iloc[1:3, 1]

1    94
2    89
Name: Y, dtype: int64

In [40]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83
5   1   1   1
6   2   1   2

In [41]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [42]:
df.tail()

    X   Y   Z
2  96  89  96
3  80  83  72
4  86  86  83
5   1   1   1
6   2   1   2

In [43]:
df.shape

(7, 3)

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       7 non-null      int64
 1   Y       7 non-null      int64
 2   Z       7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [45]:
df.describe()

               X          Y          Z
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [48]:
df.iloc[:,0]

0    78
1    85
2    96
3    80
4    86
5     1
6     2
Name: X, dtype: int64

In [50]:
df.iloc[2:3, 0]

2    96
Name: X, dtype: int64

In [51]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

#df.columns returns the column names, especially good for seeing 200 columns

#XYZ doesn't mean anything so to change it you will do the following

In [52]:
df.columns = ['apple', 'banana', 'orange']

In [53]:
df.columns

Index(['apple', 'banana', 'orange'], dtype='object')

In [55]:
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       1
6      2       1       2

In [56]:
df.describe()

           apple     banana     orange
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [58]:
df.columns = ['zebra', 'china', 'hello']

In [59]:
df.describe()

           zebra      china      hello
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [60]:
df.columns = ['apple', 'banana', 'orange']

In [61]:
df.describe()

           apple     banana     orange
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [62]:
df['banana'].mean()

62.57142857142857

In [63]:
df['banana'].min()

1

In [64]:
df['banana'].max()

94

In [65]:
df['banana'].std()

42.21712584112891

In [66]:
df['banana'].sort_values()

5     1
6     1
3    83
0    84
4    86
2    89
1    94
Name: banana, dtype: int64

In [67]:
df['banana'].sort_values(ascending=False)

1    94
2    89
4    86
0    84
3    83
5     1
6     1
Name: banana, dtype: int64

#ascending is the parameter and false is the argument

In [68]:
df['banana'].count()

7

In [69]:
df.columns=['X', 'Y', 'Z']

In [70]:
df.describe()

               X          Y          Z
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [71]:
df.columns=['apple', 'banana', 'orange']

In [73]:
df.describe()

           apple     banana     orange
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [74]:
df['orange'].sort_values(ascending=False)

1    97
2    96
0    86
4    83
3    72
6     2
5     1
Name: orange, dtype: int64

In [76]:
df['orange'].min()

1

In [77]:
df['orange'].max()

97

In [78]:
df['orange'].std()

42.46118675864325

In [79]:
df['orange'].mean()

62.42857142857143

In [80]:
df.tail()

   apple  banana  orange
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       1
6      2       1       2

In [81]:
df.head()

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   apple   7 non-null      int64
 1   banana  7 non-null      int64
 2   orange  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [83]:
df.describe()

           apple     banana     orange
count   7.000000   7.000000   7.000000
mean   61.142857  62.571429  62.428571
std    41.143767  42.217126  42.461187
min     1.000000   1.000000   1.000000
25%    40.000000  42.000000  37.000000
50%    80.000000  84.000000  83.000000
75%    85.500000  87.500000  91.000000
max    96.000000  94.000000  97.000000

In [85]:
df[['banana', 'orange']]

   banana  orange
0      84      86
1      94      97
2      89      96
3      83      72
4      86      83
5       1       1
6       1       2

In [86]:
df['apple']

0    78
1    85
2    96
3    80
4    86
5     1
6     2
Name: apple, dtype: int64

In [87]:
df.columns

Index(['apple', 'banana', 'orange'], dtype='object')

In [89]:
df.iloc[:,0]

0    78
1    85
2    96
3    80
4    86
5     1
6     2
Name: apple, dtype: int64

In [91]:
df.iloc[1:3, 2]

1    97
2    96
Name: orange, dtype: int64

In [92]:
df['orange'].count()

7

#this is data manipulation

In [93]:
df[df.apple >= 80]

   apple  banana  orange
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [94]:
df[df.banana <= 5]

   apple  banana  orange
5      1       1       1
6      2       1       2

#here i'm looking for an exact value so double equals is how to achieve that

In [99]:
df[df.orange == 1]

   apple  banana  orange
5      1       1       1

In [101]:
df[df.orange !=72] #an exclamation mark means do not include

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
4     86      86      83
5      1       1       1
6      2       1       2

#writing two conditions

In [104]:
df[(df.orange >= 72) & (df.apple >= 90)] #you can keep going by adding & () & () or () or can be represented by a vertical dash |

   apple  banana  orange
2     96      89      96

In [105]:
df[(df.orange >= 72) | (df.apple >= 90)]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [106]:
df['banana'].replace(84,50)

0    50
1    94
2    89
3    83
4    86
5     1
6     1
Name: banana, dtype: int64

In [107]:
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       1
6      2       1       2

In [109]:
df['banana']=df['banana'].replace(84,50)

In [110]:
df

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       1
6      2       1       2

In [111]:
df['banana'].sort_values

<bound method Series.sort_values of 0    50
1    94
2    89
3    83
4    86
5     1
6     1
Name: banana, dtype: int64>

In [113]:
df['banana'].sort_values(ascending=True)

5     1
6     1
0    50
3    83
4    86
2    89
1    94
Name: banana, dtype: int64

#can you solve the problem or not, there is no such thing as wrong code or right code, it's about solving the problem

In [114]:
df.head()

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [115]:
df.tail()

   apple  banana  orange
2     96      89      96
3     80      83      72
4     86      86      83
5      1       1       1
6      2       1       2

In [117]:
df[df.orange>=72]

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [118]:
df.columns

Index(['apple', 'banana', 'orange'], dtype='object')

#data manipulation using pandas